Tekla Open API Reference for Tekla Structures 2025
TextFileAttributes Methods
The TextFile.TextFileAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides EmbeddedObjectAttributes.IsEqual(Object).)
LoadAttributes
 Loads the specified attribute file.
 (Overrides EmbeddedObjectAttributes.LoadAttributes(String).)
Top
See Also
Reference
TextFile.TextFileAttributes Class
Tekla.Structures.Drawing Namespace